; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s1-p6-a6)

(:domain logistics)

(:objects a0 a1 a2 a3 a4 a5 - airplane
          c0 c1 - city
          t0 t1 t2 t3 - truck
          l0-0 l1-0 - airport
          p0 p1 p2 p3 p4 p5 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l1-0)
    (at t3 l1-0)
    (at p0 l0-0)
    (at p1 l1-0)
    (at p2 l1-0)
    (at p3 l1-0)
    (at p4 l0-0)
    (at p5 l0-0)
    (at a0 l0-0)
    (at a1 l0-0)
    (at a2 l0-0)
    (at a3 l0-0)
    (at a4 l0-0)
    (at a5 l1-0)
)

(:goal
    (and
        (at p0 l0-0)
        (at p1 l1-0)
        (at p2 l0-0)
        (at p3 l0-0)
        (at p4 l0-0)
        (at p5 l0-0)
    )
)
)

; plan
1. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 4 of 6
2. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 4 of 6
3. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 4 of 6
4. (fly a4 l0-0 l1-0)
   deleted: (at a4 l0-0)
   added: (at a4 l1-0)
   goals met: 4 of 6
5. (load t0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 t0)
   goals met: 3 of 6
6. (load t0 p4 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 t0)
   goals met: 2 of 6
7. (load t0 p5 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 1 of 6
8. (load t1 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 t1)
   goals met: 0 of 6
9. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 6
10. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 0 of 6
11. (fly a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 0 of 6
12. (load a0 p2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 0 of 6
13. (load a0 p3 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a0)
   goals met: 0 of 6
14. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 6
15. (fly a5 l1-0 l0-0)
   deleted: (at a5 l1-0)
   added: (at a5 l0-0)
   goals met: 0 of 6
16. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 6
17. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 6
18. (unload a0 p3 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 1 of 6
19. (unload a0 p2 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 2 of 6
20. (unload t0 p0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 3 of 6
21. (unload t0 p4 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 4 of 6
22. (unload t0 p5 l0-0)
   deleted: (in p5 t0)
   added: (at p5 l0-0)
   goals met: 5 of 6
23. (unload t1 p1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 6 of 6
